Revit 2027 API
StructuralSectionGeneralI Constructor
 Creates a new instance of Structural Section I Sloped Flange shape with the associated set of parameters, used to attach to structural element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionGeneralI(
	double width,
	double height,
	double flangeThickness,
	double flangeThicknessLocation,
	double flangeFillet,
	double flangeToeOfFillet,
	double slopedFlangeAngle,
	double webThickness,
	double webFillet,
	double webToeOfFillet,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
Public Sub New (
	width As Double,
	height As Double,
	flangeThickness As Double,
	flangeThicknessLocation As Double,
	flangeFillet As Double,
	flangeToeOfFillet As Double,
	slopedFlangeAngle As Double,
	webThickness As Double,
	webFillet As Double,
	webToeOfFillet As Double,
	centroidHorizontal As Double,
	centroidVertical As Double,
	analysisParams As StructuralSectionAnalysisParams
)
public:
StructuralSectionGeneralI(
	double width,
	double height,
	double flangeThickness,
	double flangeThicknessLocation,
	double flangeFillet,
	double flangeToeOfFillet,
	double slopedFlangeAngle,
	double webThickness,
	double webFillet,
	double webToeOfFillet,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams^ analysisParams
)
new :
        width : float *
        height : float *
        flangeThickness : float *
        flangeThicknessLocation : float *
        flangeFillet : float *
        flangeToeOfFillet : float *
        slopedFlangeAngle : float *
        webThickness : float *
        webFillet : float *
        webToeOfFillet : float *
        centroidHorizontal : float *
        centroidVertical : float *
        analysisParams : StructuralSectionAnalysisParams -> StructuralSectionGeneralI
Parameters
width Double
 Section width.
height Double
 Section height, depth.
flangeThickness Double
 Flange Thickness.
flangeThicknessLocation Double
 Flange Thickness Location.
flangeFillet Double
 Flange Fillet - fillet radius at the flange end.
flangeToeOfFillet Double
 Detailing distance from center of web to flange toe of fillet, in. (mm).
slopedFlangeAngle Double
 Sloped flange angle. (rad)
webThickness Double
 Web Thickness.
webFillet Double
 Web Fillet - fillet radius between web and flange.
webToeOfFillet Double
 Detailing distance from outer face of flange to web toe of fillet, in. (mm)
centroidHorizontal Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical Double
 Distance from centroid to the upper extremites along vertical axis.
analysisParams StructuralSectionAnalysisParams
 Common set of parameters for structural analysis.
See Also
Reference
StructuralSectionGeneralI Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace